from random import randint
from time import sleep
import sys
from colorama import Fore

welcome_text = ('-----------------------------------------------------------------------------------------__--------\n'
                '-------/\-------|------|-------/\------------/\-------|---------|------|--|--------|--|-----/|-----\n'
                '------/--\------|------|------/--\----------/--\------|---------|------|--|--------|--|----/-|-----\n'
                '-----/----\-----|------|-----/----\--------/----\-----|---------|------|--|--------|--|---/--|-----\n'
                '----/______\----|______|----/______\------/------\----|______---|______|--|______--|--|--/---|-----\n'
                '---/--------\---|------|---/--------\----/--------\---|------|--|------|--|------|-|--|-/----|-----\n'
                '--/----------\--|------|--/----------\--/----------\--|______|--|------|--|______|-|--|/-----|-----\n'
                '---------------------------------------------------------------------------------------------------\n'
                '---------------------------------______---______---------------------------------------------------\n'
                '----\----/-------/\-------|--/--|--------|------|--------------------------------------------------\n'
                '-----\--/-------/--\------|-/---|--------|------|--------------------------------------------------\n'
                '------\/-------/----\-----|/----|______--|______|--------------------------------------------------\n'
                '------/\------/______\----|\----|--------|---------------------------------------------------------\n'
                '-----/--\----/--------\---|-\---|--------|---------------------------------------------------------\n'
                '----/----\--/----------\--|--\--|______--|---------------------------------------------------------\n'
                '---------------------------------------------------------------------------------------------------')

for i in welcome_text:  # делает буквы цветными
    if i == '-':
        print(Fore.WHITE, i, end='', sep='')
        sys.stdout.flush()  # антиперенос строки
    else:
        print(Fore.GREEN, i, end='', sep='')
        sys.stdout.flush()  # антиперенос строки


def ass_hack():
    girl_name = input('Введите имя подруги ')
    print(f'{girl_name.capitalize()} нехуйная телка, но ее фотки я тебе не покажу')
    sleep(2)


def social_engineers():
    print(
        'Этот метод взлома очень опасен, его придумал самый известный хакер-ютубер, его имя dumbuuz\n, ни в коем случае не путать его с Дамбасом')
    print(
        'Для начал введите имя школьника, над которым вы хотите поиздеваться в скайпе,\n за то, что он украл у Вас скину из КаЭсГО')
    name_student = input('')
    print(f'Взлом {name_student} начался')
    for i in ('##########'):
        print(i, end='')
        sys.stdout.flush()  # вывод на 1-ой строке
        sleep(0.5)
    print('\nВзлом успешно завершен, мы выслали Ваши пароли в милицию, теперь Вас посадят')
    sleep(1)


status = True

while status:
    print('''\nСписок команд
    1. Взлом жеппы
    2. Взлом школьника
    ''')
    user_input = input('Введите команду\n')

    if user_input.capitalize() == 'Взлом жеппы':
        ass_hack()
    elif user_input.capitalize() == 'Взлом школьника':
        social_engineers()
    elif user_input.capitalize() == 'Иди нахуй':
        status = False
    else:
        for i in 'иди нахуй':
            print(i, end='')
            sys.stdout.flush()  # вывод на 1-ой строке
            sleep(0.5)

